<template>
  <div class=" container mx-auto p-5 flex flex-col">
    <div class="text-center text-4xl my-5 font-bold">{{ name }}</div>
    
    <div class="flex justify-around my-5">
      <div>Phone: (+86) 13592833907</div>
      <div>Email: chyiqm@qq.com</div>
    </div>

    <div class="justify-center my-5">
      <div>个人介绍</div>
      <div class=" border-2 p-5">
        <p>• 腾讯视频媒资中心前端小团队负责人</p>
        <p>• 熟练掌握前端 Vue 框架，熟练掌握 NodeJs、Koa、EggJs 开发</p>
        <p>• 熟练使用前端工程的构建、打包、部署等工具</p>
        <p>• 参与公司级开源项目协同开发</p>
        <p>• 熟练阅读英文文档</p>
      </div>
    </div>


    <div class="justify-center my-5">
      <div>工作经历</div>
      <div class=" border-2 p-5 my-5">
        <div class=" flex justify-between font-bold text-xl">
          <div>腾讯 (前端工程师)</div>
          <div>2019 年 4 月 – 至今</div>
        </div>
        <div class=" border-t-2 my-2 pt-2">
          <p class=" font-bold">腾讯视频媒资星海内容平台 - 项目前端负责人</p>
          <p>• 背景：星海内容平台是承载腾讯视频核心媒体资料数据的运营和加工入口。是数据从生成到对外分发的核心枢纽。</p>
          <p>• 负责前端需求沟通，积极推动方案落地及跟进项目进度。</p>
          <p>• 推动项目的可靠性建设，完善项目的监控上报及告警，提高问题定位/处理效率。</p>
          <p>• 负责设计和落地用户行为上报，搜集分析用户行为数据，推动功能优化，提高用户体验。</p>
        </div>
        <div class=" border-t-2 my-2 pt-2">
          <p class=" font-bold">腾讯视频媒资功能矩阵项目 - 项目前端负责人</p>
          <p>• 背景: 随着业务发展，有 30+ 独立的平台系统为媒资业务提供专项功能支撑，形成媒资功能矩阵。</p>
          <p>• 统一代码标准，完善项目 devops 流程，抹平不同项目间的开发差异，提高整体开发效率。</p>
          <p>• 主导前端服务架构优化，完成服务的前后端分离，实现页面服务的 CSR 改造，减低项目维护成本。</p>
          <p>• 搭建通用 Node 接入层，实现接口配置化接入，对接后端多种协议的 rpc 调用，大大减少开发成本。</p>
        </div>
      </div>
      <div class=" border-2 p-5 my-5">
        <div class=" flex justify-between font-bold text-xl">
          <div>腾讯 (前端工程师)</div>
          <div>2019 年 4 月 – 至今</div>
        </div>
        <div class=" border-t-2 my-2 pt-2">
          <p class=" font-bold">腾讯视频媒资星海内容平台 - 项目前端负责人</p>
          <p>• 背景：星海内容平台是承载腾讯视频核心媒体资料数据的运营和加工入口。是数据从生成到对外分发的核心枢纽。</p>
          <p>• 负责前端需求沟通，积极推动方案落地及跟进项目进度。</p>
          <p>• 推动项目的可靠性建设，完善项目的监控上报及告警，提高问题定位/处理效率。</p>
          <p>• 负责设计和落地用户行为上报，搜集分析用户行为数据，推动功能优化，提高用户体验。</p>
        </div>
        <div class=" border-t-2 my-2 pt-2">
          <p class=" font-bold">腾讯视频媒资功能矩阵项目 - 项目前端负责人</p>
          <p>• 背景: 随着业务发展，有 30+ 独立的平台系统为媒资业务提供专项功能支撑，形成媒资功能矩阵。</p>
          <p>• 统一代码标准，完善项目 devops 流程，抹平不同项目间的开发差异，提高整体开发效率。</p>
          <p>• 主导前端服务架构优化，完成服务的前后端分离，实现页面服务的 CSR 改造，减低项目维护成本。</p>
          <p>• 搭建通用 Node 接入层，实现接口配置化接入，对接后端多种协议的 rpc 调用，大大减少开发成本。</p>
        </div>
      </div>

    </div>
  </div>
</template>

<script setup lang="ts">
const name = '李梓霖'
/**
个人介绍
• 腾讯视频媒资中心前端小团队负责人
• 熟练掌握前端 Vue 框架，熟练掌握 NodeJs、Koa、EggJs 开发
• 熟练使用前端工程的构建、打包、部署等工具
• 参与公司级开源项目协同开发
• 熟练阅读英文文档
 工作经历
腾讯 (前端工程师) 2019 年 4 月 – 至今
腾讯视频媒资星海内容平台 - 项目前端负责人
• 背景：星海内容平台是承载腾讯视频核心媒体资料数据的运营和加工入口。是数据从生成到对外
分发的核心枢纽。
• 负责前端需求沟通，积极推动方案落地及跟进项目进度。
• 推动项目的可靠性建设，完善项目的监控上报及告警，提高问题定位/处理效率。
• 负责设计和落地用户行为上报，搜集分析用户行为数据，推动功能优化，提高用户体验。
腾讯视频媒资功能矩阵项目 - 项目前端负责人
• 背景: 随着业务发展，有 30+ 独立的平台系统为媒资业务提供专项功能支撑，形成媒资功能矩阵。
• 统一代码标准，完善项目 devops 流程，抹平不同项目间的开发差异，提高整体开发效率。
• 主导前端服务架构优化，完成服务的前后端分离，实现页面服务的 CSR 改造，减低项目维护成本。
• 搭建通用 Node 接入层，实现接口配置化接入，对接后端多种协议的 rpc 调用，大大减少开发成本。
前端国际化 Oteam 编译核心 - 主要开发
• 背景：为解决现有 Web 前端应用场景国际化相关问题，统一公司内国际化接入流程。搭建多语言
协作平台和工具链。
• 负责设计和开发国际化编译核心。通过编译时对代码 AST 的处理，完成代码中词条的自动提取，
自动翻译等功能。当前已支持 React，Html，Vue 等语言和框架的代码处理。同时通过插件生态，
支持其他语言处理拓展。
深圳文思海辉信息技术有限公司（前端开发） 2016 年 08 月 – 2019 年 4 月
腾讯视频 - 媒资库系统
• 背景：媒资系统承载了腾讯视频核心媒体资料数据的内部操作入口，原平台由后台兼任开发，功
能和实现相对简单。随着业务的发展，对系统的前端功能和开发质量有更高的需求
• 完成前端项目从基于 C++ 的页面模板引擎 + jQuery 到 node + vue 的升级改造。构建基础的前端开
发流程。实现更高效的开发，更好的支持业务发展。
深圳市创尔时装有限公司（网络技术） 2015 年 05 月 – 2016 年 07 月
• 负责公司官网的搭建和维护，维护公司电脑设备及网络的正常运行。
北京和堂文化有限责任公司（合伙人） 2013 年 10 月 – 2015 年 05 月
• 维持公司运行及发展
 教育背景
北京理工大学珠海学院，专业：信息工程 2010 – 2014
 */
</script>

<style scoped>
</style>